# Напишите программу, которая выводит число в стиле LCD калькулятора.
#
# На вход программе подаётся последовательность цифр, которую нужно вывести на экран в специальном стиле (см. пример).
#
# Размер всех цифр 4 символа в ширину и 7 символов в высоту. Между цифрами в выводе должен быть один пустой столбец.
# Перед первой цифрой не должно быть пробелов.
#
# Выведенные цифры должны быть обведены рамочкой, в углах которой находится символ x ("икс"), горизонтальная линия
# создаётся из символа - ("дефис"), а вертикальная -- из символа вертикальной черты: |.
#
# Формат ввода:
# Строка произвольной длины (минимум один символ), содержащая последовательность цифр.
#
# Формат вывода:
# 9 строк, содержащих цифры, записанные в указанном в задании формате.
#
# Sample Input:
#
# 0123456789
# Sample Output:
#
# x-------------------------------------------------x
# | --        --   --        --   --   --   --   -- |
# ||  |    |    |    | |  | |    |       | |  | |  ||
# ||  |    |    |    | |  | |    |       | |  | |  ||
# |           --   --   --   --   --        --   -- |
# ||  |    | |       |    |    | |  |    | |  |    ||
# ||  |    | |       |    |    | |  |    | |  |    ||
# | --        --   --        --   --        --   -- |
# x-------------------------------------------------x
from pprint import pprint

# print(' -- ')
# print('|  |')
# print('|  |')
# print('    ')
# print('|  |')
# print('|  |')
# print(' -- ')

# my_input = input()
my_input = '5'

num_dict = {
    # '0': [' -- ',
    #       '|  |',
    #       '|  |',
    #       '    ',
    #       '|  |',
    #       '|  |',
    #       ' -- '],
    #
    # '1': ['    ',
    #       '   |',
    #       '   |',
    #       '    ',
    #       '   |',
    #       '   |',
    #       '    '],
    #
    # '2': [' -- ',
    #       '   |',
    #       '   |',
    #       ' -- ',
    #       '|   ',
    #       '|   ',
    #       ' -- '],
    #
    # '3': [' -- ',
    #       '   |',
    #       '   |',
    #       ' -- ',
    #       '   |',
    #       '   |',
    #       ' -- '],
    #
    # '4': ['    ',
    #       '|  |',
    #       '|  |',
    #       ' -- ',
    #       '   |',
    #       '   |',
    #       '    '],
    #
    # '5': [' -- ',
    #       '|   ',
    #       '|   ',
    #       ' -- ',
    #       '   |',
    #       '   |',
    #       ' -- '],
    #
    # '6': [' -- ',
    #       '|   ',
    #       '|   ',
    #       ' -- ',
    #       '|  |',
    #       '|  |',
    #       ' -- '],
    #
    # '7': [' -- ',
    #       '   |',
    #       '   |',
    #       '    ',
    #       '   |',
    #       '   |',
    #       ' -- '],
    #
    # '8': [' -- ',
    #       '|  |',
    #       '|  |',
    #       ' -- ',
    #       '|  |',
    #       '|  |',
    #       ' -- '],
    #
    # '9': [' -- ',
    #       '|  |',
    #       '|  |',
    #       ' -- ',
    #       '   |',
    #       '   |',
    #       ' -- ']

    '0': ' -- \n'
         '|  |\n'
         '|  |\n'
         '    \n'
         '|  |\n'
         '|  |\n'
         ' -- ',

    '1': ['    ',
          '   |',
          '   |',
          '    ',
          '   |',
          '   |',
          '    '],

    '2': [' -- ',
          '   |',
          '   |',
          ' -- ',
          '|   ',
          '|   ',
          ' -- '],

    '3': [' -- ',
          '   |',
          '   |',
          ' -- ',
          '   |',
          '   |',
          ' -- '],

    '4': ['    ',
          '|  |',
          '|  |',
          ' -- ',
          '   |',
          '   |',
          '    '],

    '5': [' -- ',
          '|   ',
          '|   ',
          ' -- ',
          '   |',
          '   |',
          ' -- '],

    '6': [' -- ',
          '|   ',
          '|   ',
          ' -- ',
          '|  |',
          '|  |',
          ' -- '],

    '7': [' -- ',
          '   |',
          '   |',
          '    ',
          '   |',
          '   |',
          ' -- '],

    '8': [' -- ',
          '|  |',
          '|  |',
          ' -- ',
          '|  |',
          '|  |',
          ' -- '],

    '9': [' -- ',
          '|  |',
          '|  |',
          ' -- ',
          '   |',
          '   |',
          ' -- ']
}

print('x' + '----' * len(my_input) + 'x')

for smbl in my_input:
    print(*num_dict.get(smbl))

# for i, k in num_dict.items():
#     print('|' + k + '|')

print('x' + '----' * len(my_input) + 'x')
